{"mark": 318, "member": 568, "variable": 790, "mmounttable": 3, "'": 18135, "final": 606, "in": 35235, "class": 4369, "mounttabl": 2, "<cm-sep>": 18407, "revert": 456, ".": 120357, "<nl>": 144374, "this": 33719, "reverts": 337, "commit": 3830, "sha": 1071, "mounttable": 2, "to": 69018, "be": 18542, "as": 12519, "is": 38250, "no": 7248, "more": 3369, "changed": 1194, "after": 3123, "init": 374, "test": 10523, "and": 34860, "fix": 6743, "for": 35088, "inferring": 17, "pseudo-directories": 9, "an": 9575, "object": 2268, "store": 1442, "not": 16674, "created": 1742, "through": 1105, "alluxio": 435, "rearrange": 14, "code": 4140, "issues": 871, "with": 15897, "swift": 54, "loading": 463, "when": 13105, "root": 713, "container": 556, "nit": 17, "<para-sep>": 12420, "a": 46550, "stream": 2480, "reading": 510, "data": 5820, "using": 3579, "range": 677, "queries": 1040, "has": 4654, "the": 127920, "been": 2278, "closed": 626, "*": 10882, "/": 7278, "backing": 394, "input": 1366, "current": 2048, "position": 552, "of": 35328, "was": 4829, "open": 445, "till": 47, "(": 24099, "exclusive": 79, ")": 24571, "close": 945, "if": 15768, "boundary": 55, "crossed": 7, "closes": 128, "new": 6389, "endpos": 3, ">": 2241, "content": 723, "length": 482, ",": 59111, "returned": 951, "should": 7191, "read": 2182, "last": 1145, "valid": 798, "byte": 746, "behaviour": 372, "undefined": 58, "startpos": 1, "=": 2895, "or": 7226, "<": 253, "0": 11763, "block": 1032, "size": 1687, "chunks": 97, "opens": 35, "at": 3738, "mpos": 5, "wrapped": 165, "mstream": 3, "null": 2670, "path": 1815, "directory": 1074, "it": 17873, "possible": 1342, "that": 21577, "zero-byte": 2, "breadcrumb": 9, "exists": 733, "case": 3392, "recursive": 95, "listing": 74, "infer": 54, "commonprefixes": 3, "from": 11784, "empty": 1765, "delimiter": 109, "remove": 4203, "parent": 653, "portion": 51, "key": 2877, "tests": 6432, "file": 4174, "creation": 662, "atomic": 80, "multi-block": 11, "can": 8868, "validates": 186, "written": 480, "load": 1398, "metadata": 1533, "on": 11972, "list": 2780, "only": 6677, "run": 1916, "non-recursive": 3, "liststatus": 25, "infers": 4, "common": 536, "prefixes": 61, "check": 4192, "direct": 296, "children": 166, "files": 1791, "were": 1533, "inferred": 52, "indirect": 20, "having": 538, "pre-populated": 2, "prepare": 244, "by": 9973, "making": 433, "copies": 91, "test_bytes": 1, "write": 1397, "multiple": 1519, "blocks": 262, "small": 518, "enough": 404, "'int": 6, "pr": 3941, ":": 27678, "-": 15498, "cases": 1709, "stores": 268, "where": 2180, "objects": 746, "are": 12160, "pre-created": 1, "api": 4099, "ufs": 406, "renamed": 192, "checksumcommandtest.java": 1, "checksumcommandintegrationtest.java": 1, "checksum": 77, "command": 968, "md5": 20, "calculation": 114, "invalid": 649, "args": 166, "there": 4207, "looks": 206, "typo": 166, "jira": 171, "description": 530, "i": 3593, "have": 6221, "tests/src/test/java/alluxio/shell/command/checksumcommandtest.java": 1, "tests/src/test/java/alluxio/shell/command/checksumcommandintegrationtest.java": 1, "sort": 378, "option": 1025, "ls": 37, "lists": 127, "all": 7441, "pinned": 23, "sorts": 42, "result": 2172, "given": 4864, "values": 2848, "reverses": 5, "sorting": 122, "order": 1759, "hi": 20, "wanted": 88, "out": 1931, "project": 556, "look": 433, "bit": 428, "around": 464, "then": 5034, "found": 1058, "these": 2334, "tickets": 26, "thought": 46, ";": 4667, "d": 81, "fun": 8, "solve": 79, "one": 4019, "them": 1778, "let": 567, "me": 161, "know": 638, "needed/needs": 1, "improvement": 150, "optimize": 234, "concatpath": 2, "note": 1529, "element": 405, "base": 570, "paths": 511, "ignored": 340, "must": 1599, "[": 3211, "]": 3163, "+": 841, "creates": 918, "stringbuilder": 19, "correct": 878, "so": 6088, "does": 4600, "constantly": 16, "resized": 11, "throw": 969, "exception": 2302, "interrupt": 68, "await": 32, "checks": 921, "interrupted": 73, "flag": 933, "which": 7122, "will": 10023, "lead": 272, "infinite": 92, "loop": 545, "move": 1183, "alluxioworker": 11, "behind": 136, "interface": 1185, "representing": 140, "server": 2710, "starts": 350, "stops": 113, "launching": 13, "worker": 943, "system": 1627, "we": 16933, "would": 2468, "call": 1912, "but": 4920, "want": 937, "reserve": 26, "name": 4114, "main": 543, "drop": 346, "support": 4266, "java": 1636, "include": 1098, "merge": 943, "into": 3270, "advantages": 9, "0.": 2823, "mocked": 41, "without": 1742, "powermock": 24, "specification": 208, "better": 771, "separated": 152, "implementation": 1967, "highly": 28, "mechanical": 8, "following": 1323, "rename": 708, "compilation": 205, "unit": 1598, "create": 3499, "make": 3564, "implement": 753, "copy": 706, "externally-used": 1, "method": 4167, "signatures": 50, "`": 144, "add": 11637, "annotations": 284, "appropriate": 279, "methods": 1827, "their": 1089, "javadoc": 356, "replace": 675, "calls": 773, "first": 2635, "cluster": 2677, "metrics": 1347, "display": 192, "format": 1511, "tags": 283, "metric": 877, "todo": 2766, "yupeng": 3, "consider": 339, "dedicated": 119, "structure": 305, "tag": 509, "functionality": 445, "added": 3529, "future": 828, "adds": 2638, "already": 1695, "replaced": 291, "displays": 30, "short-circuit": 18, "remote": 538, "well": 981, "introduced": 473, "tagging": 11, "concept": 65, "pattern": 707, "example": 1316, "becomes": 184, "allow": 1856, "configuration.getms": 3, "accept": 324, "different": 1800, "regular": 317, "expression": 1073, "separate": 673, "digits": 26, "letters": 16, "string": 3183, "parses": 124, "milliseconds": 166, "try": 1023, "next": 827, "parse": 620, "modified": 325, "specified": 1161, "time": 4176, "units": 56, "transformed": 50, "also": 4103, "some": 3682, "location": 431, "getbyte": 1, "getms": 1, "getconf.java": 1, "consistency": 169, "codes": 126, "related": 903, "bytes": 993, "front": 65, "deflake": 7, "filesystemmastertest": 5, "permission": 358, "set": 5301, "umask": 22, "default": 4424, "bits": 149, "directories": 199, "flaky": 118, "being": 1609, "because": 3080, "admin": 508, "user": 2759, "guaranteed": 113, "test_user": 1, "since": 2854, "specialized": 34, "changing": 257, "here": 2007, "work": 1375, "flakiness": 50, "update": 3709, "use": 7945, "right": 525, "properties": 1226, "lines": 206, "skip": 655, "previously": 859, "looking": 166, "wrong": 426, "serde": 195, "now": 3313, "table": 1871, "change": 5462, "debug": 415, "level": 1163, "log": 1665, "return": 2883, "shows": 126, "users": 1162, "exist": 767, "need": 3228, "duplicated": 144, "error": 3235, "logging": 718, "messy": 25, "get": 4197, "status": 1384, "changes": 3440, "ioexception": 84, "anything": 452, "other": 2824, "than": 2258, "s3a": 17, "removes": 664, "unnecessary": 498, "mistakenly": 21, "causing": 232, "incorrectly": 134, "pass": 802, "noisy": 24, "errors": 879, "expected": 1205, "false": 772, "deprecated": 688, "faulttolerantfilesystem": 1, "alluxio-ft": 2, "//": 305, "removed": 1498, "functionality-wise": 1, "long": 1013, "ago": 67, "really": 346, "version": 6119, "configuration": 1924, "parameter": 1428, "build": 1314, "maximum": 285, "single": 1512, "query": 2870, "each": 2216, "request": 3809, "large": 505, "delete": 1418, "pagination": 48, "speed": 146, "up": 3074, "testing": 1180, "alluxio.underfs.listing.length": 1, "number": 2485, "allowing": 234, "smaller": 196, "s3": 242, "returns": 3205, "items": 298, "did": 870, "n't": 6512, "find": 789, "similar": 390, "documentation": 614, "ufss": 13, "clients": 379, "less": 500, "often": 174, "rest": 1204, "handlers": 180, "web": 179, "handler": 553, "instances": 540, "every": 827, "propagated": 82, "creating": 736, "client": 3354, "within": 854, "service": 1746, "instead": 2766, "initialize": 409, "servlet": 67, "'s": 5034, "called": 1224, "once": 1117, "subsequent": 227, "wilk": 1, "utilize": 35, "stop": 558, "intercepting": 13, "closed/cancelled": 1, "fail": 1427, "validation": 1034, "cancelled": 161, "sporadic": 3, "occurrences": 20, "illegalstateexception": 40, "logs": 582, "clean": 623, "shell": 104, "module": 886, "fixed": 1193, "checkstyle": 511, "issue": 1768, "minor": 602, "fixes": 1589, "_multimasterlocalalluxiocluster_": 1, "usage": 860, "simply": 302, "statement": 883, "_catcommand_": 1, "automatic": 114, "resource": 914, "management": 269, "_copytolocalcommand_": 1, "_tailcommand_": 1, "filesystemutils": 1, "filesystem": 143, "integrated": 24, "filesystemintegrationtest": 1, "schedules": 20, "asynchronously": 201, "persisted": 174, "under": 894, "odd": 36, "functions": 1252, "implemented": 380, "opposed": 38, "normal": 317, "passing": 246, "together": 225, "any": 4313, "implies": 58, "belongs": 84, "passed": 609, "while": 1429, "implied": 12, "necessarily": 55, "strictly": 81, "enforced": 50, "moving": 226, "implementations": 534, "provides": 462, "flexibility": 26, "they": 2207, "longer": 794, "access": 1342, "filesystemcontext": 14, "perform": 407, "checkconsistency": 1, "persist": 199, "waitcompleted": 1, "operations": 914, "aggregator": 272, "aggregates": 52, "hosts": 232, "cluster-level": 5, "introduces": 401, "multi-value": 53, "value": 5142, "cachingfilesystem": 1, "metadatacachingbasefilesystem": 2, "refactor": 997, "used": 5278, "manage": 129, "closeable": 15, "resources": 726, "wrapper": 290, "instance": 1801, "wraps": 96, "forward": 219, "messages": 1505, "factory": 407, "constructs": 171, "cache": 2228, "none": 323, "inserted": 75, "cached": 341, "its": 2383, "own": 542, "state": 3020, "miss": 71, "insert": 318, "purposes": 182, "motivation": 743, "simplify": 359, "logic": 1451, "e.g.": 164, "separating": 21, "handle": 1442, "reducing": 49, "details": 382, "convenience": 87, "implementing": 108, "needs": 884, "non-default": 21, "avoid": 1559, "duplication": 78, "outside": 281, "prevent": 575, "confusion": 80, "thinner": 1, "consolidate": 35, "lambda": 167, "reference": 728, "push": 277, "alluxio.server.ft.journal.journalbackupintegrationtest": 1, "#": 1991, "backuprestoretest": 1, "classloader": 158, "entering": 28, "land": 6, "hadoop": 219, "irrelavent": 2, "message": 3133, "switch": 303, "context": 1344, "provided": 1060, "before": 2924, "else": 301, "ensures": 383, "classes": 1227, "loaded": 379, "same": 3306, "problem": 643, "setting": 1380, "may": 2146, "see": 1318, "login": 111, "like": 1453, "failed": 1013, "cause": 820, "two": 1646, "classloaders": 22, "jar": 351, "fs": 91, "world": 91, "second": 745, "causes": 343, "actually": 713, "identified": 84, "pair": 116, "classname": 99, "tfsshell": 4, "enable": 783, "fileinfo": 6, "spell": 10, "mistake": 50, "tachyonfs.java": 2, "argv": 1, "stored": 529, "generalize": 20, "extension": 485, "registry": 308, "down-side": 2, "discovery": 140, "mechanism": 241, "controllable": 9, "your": 803, "designed": 46, "replacement": 67, "standard": 302, "depending": 239, "jvm": 365, "discovers": 10, "services": 346, "take": 732, "priority": 232, "getting": 382, "discovered": 75, "you": 1726, "wish": 25, "manual": 156, "registration": 107, "approach": 206, "useful": 570, "instantiated": 83, "arguments": 467, "give": 224, "factories": 77, "registered": 323, "way": 1148, "start": 1748, "opportunity": 19, "indicate": 263, "whether": 1354, "requested": 336, "lib": 48, "built-in": 121, "additional": 809, "occurs": 175, "particular": 337, "type": 4832, "discover": 46, "register": 400, "available": 1247, "read-only": 77, "view": 382, "finds": 129, "extensions": 206, "class-loads": 1, "registers": 77, "override": 455, "existing": 1464, "automatically": 372, "precedence": 71, "over": 966, "resets": 43, "clears": 56, "stands": 11, "rediscovers": 2, "reset": 560, "reinitialise": 3, "unregisters": 10, "extract": 427, "underfilesystemfactoryregistry": 1, "put": 572, "reusable": 51, "generic": 351, "address": 663, "helper": 407, "closeables": 4, "patterns": 216, "avoided": 47, "esp": 5, "constructor": 731, "bug": 1166, "inodetree": 6, "script": 463, "docs": 681, "loadmetadata": 15, "mounts": 13, "folder": 212, "storage": 549, "loads": 138, "unless": 233, "excluding": 34, "matching": 424, "prefix": 586, "exclusions": 19, "mounted": 82, "assumes": 81, "mount": 177, "continue": 284, "repeatedly": 44, "directly": 710, "deletions": 16, "reflected": 43, "ie": 92, "deleting": 243, "foo": 151, "running": 1328, "loadufs": 2, "point": 870, "ignore": 760, "assume": 253, "consistent": 388, "excluded": 98, "calvin": 15, "hack": 115, "line": 792, "utility": 301, "ufspath": 4, "alluxiopath": 1, "addition": 265, "operation": 1122, "matches": 317, "exclusion": 18, "guarantee": 131, "do": 5702, "alluxio/ufs": 1, "pairing": 2, "encoded": 166, "_": 177, "$": 585, "begins": 42, "necessary": 873, "results": 1213, "equal": 302, "updates": 862, "timer": 282, "journal": 345, "flush": 295, "names": 1281, "backupmanager": 4, "contains": 1070, "about": 1110, "asyncjournalwriter": 1, "ufsjournallogwriter": 1, "faulttolerantalluxiomasterprocess": 3, "easy-debugging": 1, "monitoring": 207, "mastr_address": 1, "master_hostname": 1, "'m": 190, "ashamed": 2, "how": 933, "reason": 487, "why": 559, "harden": 12, "handling": 937, "inode": 139, "crawler": 2, "iterate": 123, "doing": 452, "read-ahead": 1, "buffering": 32, "traversal": 27, "done": 1148, "concurrently": 157, "depth": 31, "branch": 298, "preserved": 64, "iteration": 195, "makes": 1060, "applying": 125, "those": 942, "entries": 691, "later": 604, "efficient": 144, "guaranteeing": 7, "iterated": 17, "signal": 104, "end": 1377, "underlying": 409, "enumeration": 19, "buffered": 108, "entry": 823, "queue": 466, "still": 1435, "completion": 243, "crawlers": 5, "active": 526, "executor": 343, "coordinating": 88, "thread": 1504, "iterator": 203, "threads": 588, "traverse": 47, "keep": 699, "storing": 124, "failure": 800, "executors": 58, "futures": 76, "linked": 47, "fast": 155, "insertion/removal": 1, "buffers": 209, "process": 1001, "coordinator": 273, "task": 1992, "turn": 161, "spawns": 9, "tasks": 1048, "runnable": 94, "dir": 186, "buffer": 908, "journalentry": 3, "enumerate": 4, "immediate": 34, "further": 253, "branching": 10, "chain": 106, "dirs": 20, "cancel": 204, "pending": 338, "during": 1529, "shutdown": 615, "complete": 610, "remembered": 7, "hasnext": 13, "fetching": 155, "item": 258, "requires": 502, "could": 1617, "go": 485, "unnoticed": 5, "raise": 42, "positives": 9, "taking": 146, "backup": 229, "contain": 592, "master": 1166, "ensure": 1317, "failures": 508, "overlooked": 5, "session": 475, "cleanable": 1, "read/write": 48, "side": 668, "require": 429, "id": 1766, "unused": 684, "ids": 397, "deprecate": 144, "field": 3642, "sessions": 77, "until": 983, "isolated": 92, "optional": 998, "int64": 187, "session_id_deprecated": 11, "internal": 1082, "representation": 254, "temporary": 294, "accumulated": 23, "back": 942, "moved": 538, "netty": 378, "mworker.cleanupsession": 1, "msessionid": 1, "associated": 404, "heartbeat": 193, "thrift": 47, "entirety": 3, "including": 441, "concluded": 4, "lingering": 7, "currently": 1756, "wo": 353, "reads": 323, "w/": 56, "caching": 261, "applicationmastertests": 1, "simple": 606, "modify": 500, "improve": 762, "requestspace": 1, "exceptions": 688, "runtime": 1313, "swallowed": 14, "made": 837, "seem": 91, "space": 350, "regenerate": 58, "properly": 526, "propagate": 177, "mode": 827, "backwards-compatibility": 9, "tree": 665, "re-init": 2, "above": 502, "lost": 178, "owner/group": 10, "reproduce": 83, "inherit_acl": 1, "matters": 22, "initial": 640, "user/group": 3, "chmod": 16, "restart": 320, "chown": 8, "original": 756, "arg": 69, "options": 806, "shells": 2, "execution": 693, "fscontext": 4, "grpc": 317, "channels": 103, "abrupt": 2, "channel": 916, "termination": 87, "thus": 404, "annoying": 15, "save": 233, "rpc": 277, "hdfs": 217, "filestatus": 2, "getfileblocklocations": 1, "getfileblocklocation": 2, "offset": 651, "len": 13, "stat": 16, "constructing": 67, "manually": 250, "getfilestatus": 4, "saves": 54, "locations": 112, "adding": 1428, "classpath": 210, "style": 312, "extra": 375, "//bucket": 1, "//bucket/folder": 1, "integration": 995, "local": 1083, "inputstream": 67, "zero": 287, "total": 443, "far": 156, "encountered": 92, "suite": 168, "inputstream.read": 8, "buffer.length": 4, "s3ainputstream": 1, "checkpoint": 309, "even": 1121, "had": 593, "working": 314, "mkdirs": 10, "edge": 120, "locked": 51, "write_inode": 4, "suppose": 25, "/a/b/c": 7, "/a": 21, "both": 1425, "a-": 4, "b": 333, "otherwise": 897, "concurrent": 331, "/a/c": 2, "a/b": 10, "succeed": 121, "full": 576, "leading": 159, "leaving": 75, "examples": 204, "lock": 806, "inodes": 29, "b-": 1, "c": 217, "read-locked": 1, "enhanced": 43, "lockedinodepathtest": 1, "listblocks": 1, "merges": 65, "getfileblockinfolist": 1, "getstatus": 19, "uristatus": 2, "publicapi": 6, "workernetaddress": 1, "tostring": 170, "lineage": 33, "doc": 950, "ufsjournalintegrationtest": 2, "journalling": 1, "must_cache": 1, "again": 630, "cache_through": 1, "allowexists=true": 1, "reworking": 7, "follow": 502, "restful": 16, "principles": 6, "endpoints": 541, "actions": 407, "decouples": 7, "writing": 397, "implements": 277, "proxy": 575, "inside": 453, "retry": 669, "re-query": 3, "e.g": 1278, "failover": 102, "gets": 909, "duration": 183, "hidden": 141, "interact": 34, "worker_block_heartbeat_timeout_ms": 1, "policy": 861, "uses": 1005, "exponential": 21, "backoff": 112, "bound": 191, "performed": 210, "giving": 50, "sleep": 111, "10ms": 1, "100ms": 17, "500ms": 8, "timings": 19, "assuming": 113, "retries": 188, "takes": 386, "previous": 772, "times": 516, "sleeps": 8, "50ms": 3, "attempt": 444, "however": 981, "just": 1946, "multiply": 13, "random": 282, "jitter": 9, "hotspotting": 1, "lookup": 451, "needed": 1048, "survive": 12, "die": 21, "happening": 74, "bigger": 69, "throws": 362, "nearly": 19, "able": 853, "resolve": 452, "property": 1059, "raw": 272, "/master/configuration": 1, "controlling": 21, "resolved": 255, "distributedloadcommand": 4, "premise": 3, "job": 1222, "overhead": 132, "least": 504, "0~0": 2, "seconds": 295, "jobworker": 10, "heartbeats": 16, "jobmaster": 12, "reported": 241, "backed": 82, "important": 233, "lot": 277, "jobs": 567, "many": 636, "submitted": 80, "what": 1032, "per": 853, "increase": 271, "outgoing": 48, "configurable": 242, "round": 131, "robins": 1, "handles": 242, "filled": 59, "environment": 458, "machine": 207, "approximately": 19, "ran": 338, "free": 195, "followed": 147, "distributedload": 6, "checked": 237, "timed": 74, "old": 1039, "minutes": 209, "45x": 1, "speedup": 21, "nothing": 629, "counted": 54, "failing": 432, "potential": 206, "memory": 1125, "leak": 169, ".0": 36, "underfilesystem": 8, "expensive": 147, "configuration.get": 2, "mowner/mgroup": 1, "keyvalue": 41, "poms": 10, "keyvalue/common": 1, "pom": 127, "keyvalue/client": 1, "keyvalue/server": 1, "keyvalue/hadoop": 1, "deps": 33, "assemly": 1, "included": 417, "cli": 501, "uber": 18, "cc": 46, "partition": 1122, "represented": 96, "split": 486, "introduce": 797, "dependency": 1094, "commands": 241, "rely": 222, "newest": 22, "lastcontactseccomparator": 3, "workerinfo": 6, "prior": 291, "returning": 355, "workers": 236, "defaultblockmaster": 2, "determine": 339, "most": 765, "recently": 190, "contacted": 4, "o.lastcontactsec": 1, "sorted": 215, "screenshot": 29, "canceling": 12, "correctly": 700, "cleans": 78, "control": 382, "tied": 28, "entire": 268, "ready": 291, "setattribute": 26, "merged": 370, "supplied": 163, "filesystemoptions": 3, "defaults": 337, "based": 1414, "unique": 307, "sent": 460, "wire": 247, "explicitly": 543, "arose": 6, "merging": 183, "setattributepoptions": 5, "attributes": 308, "came": 55, "sends": 219, "investigation": 34, "ttl": 104, "ttlaction": 15, "defaultfilesystemmaster": 8, "independently": 48, "accordingly": 107, "lastly": 10, "exposed": 199, "protooptions": 1, "fields": 2240, "'ve": 531, "non-null": 143, "static": 676, "imports": 268, "utilities": 104, "/alluxio/core/common/src/test/java/alluxio/underfs/ufsfilestatustest.java": 2, "reuse": 270, "speeds": 21, "reusing": 50, "localalluxiocluster": 6, "throughout": 41, "avoids": 158, "tearing": 10, "down": 822, "recreating": 10, "between": 1131, "individual": 266, "required": 1189, "fall": 127, "loganyfailure": 2, "indicates": 194, "alluxioexceptions": 4, "increment": 122, "runtimeexception": 28, "thrown": 607, "always": 1471, "treat": 170, "ioexceptions": 15, "denote": 6, "afaik": 4, "negative": 282, "/alluxio/core/common/src/test/java/alluxio/underfilesystemfactoryregistryruletest.java": 2, "doctor": 7, "show": 407, "/bin/alluxio": 1, "fsadmin": 8, "server-side": 48, "identical": 82, "key1": 15, "//name2": 1, "port2": 2, "masterhostname3": 2, "masterport": 8, "masterhostname4": 2, "//name1": 1, "port1": 2, "masterhostname1": 2, "masterhostname2": 2, "key2": 16, "errorvalue2": 1, "errorvalue1": 1, "npe": 375, "happens": 370, "createfile": 9, "listfile": 1, "happen": 561, "finish": 170, "matcher": 68, "writes": 328, "readable": 126, "crash": 72, "sure": 1258, "createoptions.ensureatomic": 1, "escape": 109, "alluxio.metrics.metricssystem": 2, "replacing": 116, "escapes": 16, "uri": 308, "%": 506, "2f": 2, "replaces": 193, "2e": 2, "dots": 21, "separators": 19, "special": 428, "interpreted": 51, "unescaped": 21, "interfere": 29, "alluxiouri": 9, "unescapes": 1, "characters": 290, "escaped": 92, "strings": 469, "safely": 101, "unescape": 5, "wire.thriftutils": 1, "streams": 1033, "serve": 81, "much": 448, "purpose": 293, "except": 277, "cleaner": 61, "responsible": 176, "defining": 104, "serialized": 275, "to/from": 33, "_chgrpcommandtest_": 1, "_chmodcommandtest_": 1, "_chowncommandtest_": 1, "_localminidfscluster_": 1, "integer": 399, "literal": 306, "predefined": 40, "sizes": 148, "constants": 241, "specifically": 174, "constants.gb": 2, "localalluxioclusterresource": 1, "filesystemaclintegrationtest": 1, "initialization": 241, "cleanup": 834, "cleaning": 145, "validating": 94, "port": 545, "non-negative": 8, "improves": 162, "indexedset": 7, "index": 4424, "fieldindex": 1, "utilization": 33, "removing": 497, "todos": 42, "optimization": 311, "partial": 233, "no-op": 341, "array": 1347, "few": 524, "rpcs": 147, "isdirectory": 11, "dynamically": 142, "slf4j": 19, "logger": 245, "specify": 460, "argument": 515, "information": 1236, "loginfo": 1, "feature": 1315, "usually": 152, "global": 620, "worse": 45, "effect": 217, "sea": 1, "flow": 195, "flooded": 2, "refer": 170, "loglevel.java": 1, "initialized": 312, "hbase": 12, "twice": 190, "wait": 907, "noop": 131, "transform": 347, "printing": 68, "something": 372, "mirroring": 4, "hierarchy": 76, "system.exit": 10, "defaultalluxioworker": 3, "binaries": 19, "runs": 393, "exit": 161, "loaders": 8, "mirrors": 7, "alluxioworkerservice": 1, "among": 110, "things": 401, "hard": 226, "packet": 113, "switches": 52, "streaming": 287, "conflicts": 270, "our": 927, "closing": 264, "allows": 1062, "acked": 70, "immediately": 348, "extremely": 38, "unlikely": 39, "versions": 786, "hook": 79, "stopping": 80, "possibly": 109, "loses": 14, "connection": 1126, "zookeeper": 386, "steps": 254, "primary": 350, "noopcontext": 1, "completes": 120, "opts": 7, "descriptions": 55, "various": 319, "consistently": 57, "opt": 20, "comments": 365, "in-alluxio": 7, "fallback": 298, "co-located": 3, "lazy": 112, "apps": 29, "impala": 7, "panic": 96, "applications": 213, "non-empty": 51, "preloaded": 2, "hostnames": 29, "part": 1042, "indicated": 43, "non-hdfs": 10, "updated": 1074, "anonymous": 131, "alluxio.underfs.abstractufsmanager": 2, "addmount": 2, "import": 465, "blank": 104, "serialization": 439, "json": 1237, "serialiation/deserialization": 1, "custom": 712, "serializer": 66, "accesscontrollist": 4, "accesscontrollistserializer": 1, "serialize": 201, "deserializer": 71, "accesscontrollistdeserializer": 1, "deserialize": 136, "keeping": 104, "info": 663, "acl": 103, "fewer": 40, "conversions": 43, "to/": 1, "convert": 585, "renaming": 101, "refactoring": 281, "authorization": 292, "posix": 9, "file/directory": 6, "retain": 81, "imply": 18, "gist": 4, "permissionstatus": 2, "filesystempermission": 1, "filesystemaction": 1, "nesting": 11, "improvements": 192, "key-value": 59, "major": 182, "improved": 158, "grammar": 113, "yaml": 308, "house": 4, "variables": 394, "dfsiointegrationtest": 2, "testtype": 4, "represents": 453, "types": 1915, "net": 18, "source": 2176, "truth": 16, "non-singleton": 1, "probably": 226, "become": 230, "requests": 986, "waits": 118, "assigned": 335, "exact": 146, "differ": 35, "systems": 107, "acquire": 128, "verify": 985, "launches": 10, "three": 226, "servers": 391, "ports": 103, "non-zero": 22, "easy": 139, "tell": 112, "everything": 267, "little": 200, "complicated": 60, "construction": 130, "figure": 103, "decide": 132, "started": 471, "boolean": 461, "tieredidentity": 1, "nearest": 22, "signature": 260, "simpler": 111, "count": 835, "-h": 14, "rollback": 39, "prints": 70, "folders": 55, "human": 38, "chaomin": 9, "nosasl": 9, "setup": 520, "modifications": 534, "re-use": 57, "race": 284, "condition": 498, "simulates": 25, "belonging": 29, "define": 310, "sub": 128, "track": 307, "provide": 719, "expired": 190, "extends": 130, "cleanupsession": 1, "function": 3041, "docker": 301, "hms": 16, "version_creation_time": 16, "previous_version": 8, ".alluxio.proto.journal.removetableentry": 8, "remove_table": 8, "sync": 344, "partitions": 632, "means": 782, "hive": 170, "detected": 115, "numbers": 241, "concurrency": 67, "model": 1023, "optimistic": 11, "updating": 332, "multipart": 61, "upload": 192, "completing": 32, "xml": 493, "response": 1855, "identifies": 24, "newly": 230, "bucket": 495, "entity": 315, "abort": 163, "parts": 281, "python": 241, "initiates": 10, "uploads": 85, "initializing": 102, "uploading": 26, "raft": 106, "timeout": 936, "garbage": 68, "collection": 446, "trigger": 604, "downside": 11, "increasing": 92, "harder": 43, "detect": 238, "slow": 216, "flushes": 21, "trying": 369, "processing": 600, "lock/unlock": 4, "dataserverblockreadhandler": 2, "dataserverufsblockreadhandler": 1, "dataserverblockreadhanlder": 1, "netty-rpc": 1, "multiworkerintegrationtest": 1, "short": 236, "circuit": 155, "deprecates": 41, "accessblock": 1, "openblock/closeblock": 1, "==": 288, "protocol": 564, "achieve": 58, "combine": 83, "unittests": 8, "createoptionstest.java": 2, "alluxio.security.group.cachedgroupmapping": 2, "runufstest": 1, "credentials": 251, "mounting": 35, "compatibility": 568, "target": 614, "validate": 759, "contract": 69, "primarily": 37, "intended": 219, "developers": 50, "runufstests": 4, "against": 632, "performance": 697, "databuffer": 2, "alluxio-ui": 1, "webui": 7, "/.port_coordination": 1, "tslint": 13, "disable-next-line": 6, "only-arrow-functions": 1, "scroll": 130, "top": 349, "presses": 2, "loc.action": 4, "===": 17, "'pop": 2, "||": 27, "'replace": 2, "scroll-to-top": 2, "location.state": 2, "200ms": 4, "delay": 213, "firefox": 8, "?": 1544, "latest": 497, "points": 296, "...": 850, "webpack": 8, "config": 3026, "customisation": 7, "rewires": 1, "etc": 624, "pull": 1260, "renames": 71, "modules": 260, "deadlock": 127, "expire": 97, "amount": 217, "eviction": 103, "asynchronous": 77, "testequals": 2, "equalstest": 2, "core/client": 1, "core/server": 1, "form": 428, "titled": 7, "figured": 17, "ends": 101, "conforms": 8, "naming": 183, "conventions": 26, "accurately": 36, "async": 500, "reasonable": 84, "compaction": 318, "disappear": 10, "across": 427, "restarts": 59, "spamming": 10, "orphan": 8, "warn": 147, "translate": 55, "owner": 450, "translatebucketacl": 1, "mapping": 842, "comment": 417, "nits": 10, "aws": 70, "group": 1248, "translated": 57, "util": 157, "s3n": 4, "translates": 32, "r": 52, "x": 293, "writable": 44, "+w": 1, "grant": 104, "read_acp": 1, "write_acp": 1, "assign": 155, "everyone": 24, "revoked": 33, "authenticated": 53, "via": 930, "yet": 824, "inherited": 35, "limited": 111, "map": 1804, "read/write/exec": 1, "object-level": 2, "typically": 135, "applicable": 226, "rid": 82, "retrieved": 114, "openfile": 10, "blockinfo": 5, "outdated": 66, "ui": 263, "diamond-operator": 1, "efficiently": 30, "rule": 516, "scheduling": 92, "care": 173, "resetting": 34, "afterwards": 55, "sets": 724, "temporarily": 92, "scheduled": 223, "cp": 81, "preserve": 135, "sometimes": 266, "wants": 93, "such": 1251, "permissions": 350, "preserves": 24, "mappings": 548, "alice": 15, "staff": 7, "bob": 17, "represent": 207, "groups": 219, "copying": 124, "preservation": 3, "coverage": 300, "safe": 394, "millisecond": 44, "indicating": 128, "waiting": 360, "lazily": 99, "upon": 217, "inquiry": 1, "might": 853, "off": 294, "though": 427, "turned": 111, "certain": 284, "period": 225, "streasm": 1, "determining": 57, "behavior": 835, "eventual": 26, "due": 1073, "s3restservicehandler": 1, "reconsider": 5, "authentication": 823, "sdk": 173, "works": 564, "alluxio-underfs-swift": 1, "definition": 465, "apis": 486, "communicate": 33, "third": 85, "party": 35, "endpoint": 985, "swiftfs": 1, "non-amazon": 1, "bugs": 209, "underfs": 11, "dynamic": 450, "propertykey": 11, "generated": 1230, "interesting": 45, "surrounds": 1, "double": 460, "quotes": 89, "lu": 12, "ufsmanager": 3, "defaultacl": 2, "overwrite": 123, "masking": 10, "immutable": 199, "mutable": 85, "generate": 778, "uncovered": 13, "profile": 102, "masked": 13, "inheritance": 40, "respect": 100, "basically": 68, "violate": 9, "per-ufs": 1, "clusters": 313, "dependencies": 999, "alluxio-underfs": 1, "sleepfs": 1, "tests/": 3, "recall": 13, "leave": 121, "invoked": 237, "supported": 863, "tiered": 47, "interference": 16, "site-properties": 9, "tolerance=": 1, "/version": 2, "pre-load": 7, "site_conf_dir": 5, "temp": 167, "site": 56, "prop": 22, "neither": 96, "nested": 461, "resolvedmap": 2, "kinds": 37, "remains": 83, "{": 3260, "}": 3201, "simulate": 222, "ext": 4, "picked": 534, "unrecognized": 18, "built": 221, "unknown": 337, "alias": 434, "ssd": 5, "rather": 649, "early": 225, "augment": 13, "confdocgen": 2, "unrelated": 42, "'bin/alluxio": 1, "head": 57, "gain": 27, "commandname": 1, "instantiate": 90, "concrete": 140, "print": 280, "help": 636, "bin/alluxio": 5, "sub-command": 6, "\u201c": 303, "\u201d": 302, "alluxio.shell.command.helpcommand.java": 1, "inheriting": 9, "alluxio.shell.command.abstractshellcommand": 1, "deleted": 646, "soon": 166, "collected": 79, "precautionary": 3, "measure": 49, "manages": 48, "child": 413, "another": 864, "knows": 51, "operate": 69, "correctness": 49, "/a/b": 10, "tries": 210, "injection": 99, "fileoutstream": 8, "delegation": 31, "canceled": 42, "easier": 376, "libraries": 129, "penalty": 13, "negligible": 5, "circumstances": 25, "application": 1081, "warning": 536, "commonoptions": 17, "true": 1147, "ttlnotused": 2, "ttlactionnotused": 2, "history": 156, "retrying": 80, "too": 832, "prepared": 69, "missingctor": 13, "upcoming": 47, "abstract": 277, "ones": 247, "ticket": 60, "wip": 158, "prs": 125, "specific": 828, "generating": 224, "facing": 10, "non-internal": 1, "documented": 285, "packet_size": 4, "proto": 157, "protogen": 1, "signituare": 1, "reader": 328, "writer": 147, "updata": 1, "caller": 207, "sites": 28, "protobuf": 140, "in/outstream": 1, "param": 236, "present": 654, "host": 517, "best": 158, "effort": 104, "send": 886, "throwing": 170, "cost": 201, "formatting": 253, "nontrivial": 17, "seek": 128, "instream": 3, "outstream": 2, "caches": 135, "seeks": 13, "fully": 281, "involve": 29, "locally": 192, "caveat": 7, "beginning": 118, "pos": 12, "mfilelength": 2, "addresses": 390, "drive": 21, "pool": 451, "managing": 50, "healthy": 37, "disables": 81, "pooling": 30, "throughput": 70, "reused": 119, "strategy": 375, "scalability": 13, "pools": 30, "grow": 42, "keys": 966, "acquires": 21, "fails": 792, "username": 175, "joss": 9, "parameters": 1154, "substitute": 13, "midpartrange": 1, "overflow": 102, "abstractrange": 1, "named": 288, "'length": 1, "expects": 90, "'end": 6, "v1.version": 11, "release": 563, "development": 88, "yarn": 37, "version-snapshot": 274, "recompile": 4, "_includes": 1, "resolving": 154, "downloaded": 54, "re-generate": 6, "tables": 449, "secondary": 66, "checkpoints": 79, "supposed": 120, "bunch": 82, "4k": 6, "4kb": 9, "rc5": 1, "alluxio.user.block.remote.read.buffer.size.bytes=4kb": 1, "significant": 91, "client-size": 1, "8mb": 7, "swagger": 130, "resulting": 195, "attached": 156, "styling": 13, "bootswatch": 1, "templates": 673, "chosen": 262, "colors": 15, "blue": 10, "others": 180, "org.junit.assert": 8, "org.junit.assert.assertequals": 7, "org.junit.assert.assertfalse": 2, "org.junit.assert.asserttrue": 6, "org.junit.assert.assertnull": 2, "assert": 364, "shorten": 11, "interval": 380, "monotonically": 21, "backoffs": 2, "randomness": 3, "contention": 45, "lower": 203, "max": 577, "5min": 1, "30sec": 1, "responsive": 6, "max-wait": 1, "periods": 15, "choose": 136, "colon": 25, "yml": 27, "puts": 49, "escaping": 50, "reserved": 170, "marks": 68, "broke": 44, "syntax": 462, "separator": 95, "conform": 41, "lsr": 1, "recursively": 95, "computes": 59, "therefore": 457, "convention": 82, "bool": 120, "updatetimestamps": 8, "updatelastaccesstime": 8, "persisting": 26, "completed": 492, "succeeds": 54, "mobjs": 1, "clear": 387, "containsobj": 1, "indexed": 195, "mobjects": 2, "hash": 347, "uniqueness": 24, "maintain": 126, "localunderfilesystem": 2, "covered": 132, "instanced": 6, "conf": 53, "obtain": 73, "modification": 240, "params": 269, "alluxio-site.properties": 6, "instancedconfiguration": 1, "instancedconfiguration.defaults": 1, "conf.set": 1, "filesystem.factory.create": 1, "unstable": 56, "normalfs": 1, "likewise": 14, "customizedfs": 1, "modifying": 73, "programmatically": 23, "syncing": 30, "synced": 38, "never": 873, "impression": 2, "rescheduling": 6, "replay": 115, "practice": 62, "stack": 349, "traces": 58, "tostring/getmessage": 1, "warnings": 332, "parallel": 307, "udb": 14, "executes": 100, "callables": 2, "callable": 44, "re-thrown": 1, "poll": 155, "threw": 21, "isdone": 1, "sequentially": 54, "reduce": 560, "databases": 99, "supply": 48, "preconditions.checknotnull": 14, "alluxio.server.worker.alluxio.worker.block.allocator.maxfreeallocator": 2, "allocateblock": 4, "alluxio.worker.block.allocator.maxfreeallocator": 4, "getter": 94, "non-nullable": 21, "javadocs": 166, "setupmastercluster": 1, "multi-master": 1, "journalshutdownintegrationtest": 4, "setupmultimastercluster": 1, "setupsinglemastercluster": 1, "decrease": 31, "okay": 39, "my": 219, "upgrade": 1228, "jetty": 107, "jdk": 310, "regression": 154, "spark": 76, "chance": 106, "containerincludejarpattern": 2, "examines": 8, "container-path": 2, "jars": 106, "tlds": 4, "web-fragments": 2, "omit": 40, "jstl": 2, ".tlds": 2, "jsp": 3, "engine": 277, "scan": 171, "maprfs": 1, "clarify": 82, "mapr-fs": 1, "docs/cn/architecture.md": 2, "docs/cn/command-line-interface.md": 1, "propagation": 42, "checkpointing": 87, "hasttl": 1, "corner": 63, "buckets": 261, "rejects": 24, "constants.no_ttl": 2, "unifying": 9, "exceptionmessage": 3, "preconditionmessage": 2, "boiler": 6, "plate": 10, "ununsed": 2, "invocations": 61, "semicolon": 35, "!": 712, "minimize": 56, "putting": 50, "formats": 244, "precondition": 23, "messageformat": 2, "thread-safe": 96, "guard": 102, "sub-message": 1, "contained": 156, "preconditionmessage.java": 1, "redundant": 238, "opening": 121, "detail": 110, "stating": 6, "incomplete": 72, "opened": 89, "capability": 89, "fuse": 48, "issued": 61, "internally": 202, "rcp": 3, "reduced": 99, "ulimit": 2, "validateenv": 9, "limit": 841, "validations": 105, "checking": 589, "processes": 120, "limits": 128, "ms-related": 1, "transformation": 197, "master_connection_timeout_ms": 1, "master_journal_flush_batch_time_ms": 1, "apply": 438, "filesystemmasterclientservicehandler": 1, "clientservicehandlers": 1, "unexpected": 119, "centralized": 20, "converted": 260, "receive": 255, "manager": 375, "regardless": 161, "verifies": 188, "binfan": 8, "mocking": 31, "background": 95, "report": 721, "summary": 237, "zookeeperaddresses": 1, "enabled": 824, "parallelize": 13, "processed": 308, "txid": 4, "incremental": 85, "batch": 645, "events": 473, "syncs": 8, "proceed": 68, "setowner": 3, "superuser": 25, "proceeds": 6, "end-user": 11, "super": 111, "inodepermissionchecker": 1, "permitted": 85, "checker": 114, "algorithm": 292, "yarnclient": 1, "yarnutils": 1, "nmclient": 3, "applicationmaster": 6, "mostly": 153, "tested": 348, "gnuparser": 1, "dead": 99, "amrmclient": 1, "restoring": 79, "seeing": 39, "strange": 37, "eliminates": 17, "alternative": 125, "away": 187, "io": 219, "filesystem.get": 7, "edit": 152, "eliminated": 30, "heavy": 35, "statically-initialized": 1, "believe": 43, "unsigned": 32, "comparing": 102, "k": 137, "impacted": 20, "bytebuffer": 86, "ended": 57, "left": 378, "attempts": 209, "mesos": 16, "exclude": 193, "usingenv": 1, "consequence": 26, "alluxio-env": 1, "expressions": 540, "corresponding": 440, "failedpreconditionexception": 2, "non-persistent": 54, "persistent": 223, "filesystemaclintegration": 2, "output": 1323, "executing": 182, "meet": 24, "expectations": 13, "expectedowner": 1, "expectedgroup": 1, "compatible": 354, "unix/linux": 1, "scheduler": 171, "destruction": 17, "idle": 100, "restarting": 55, "upto": 12, "configured": 796, "callback": 234, "fired": 28, "ggezer": 3, "shutting": 104, "channelkey": 1, "equals": 204, "missing": 1039, "hashcode": 116, "caused": 297, "managed": 265, "actual": 621, "meta": 255, "interfaces": 194, "alluxiostatusexception": 3, "abstractufs": 1, "describes": 55, "snapshot": 1285, "replica": 161, "problems": 235, "stopped": 190, "solves": 21, "non-persisted": 7, "unittest": 10, "non-existing": 33, "drectory": 1, "folder/file1": 1, "folder/file2": 1, "everytime": 8, "problematic": 72, "-f": 5, "underfilestatus": 2, "listrecursive": 3, "listoptions": 1, "stripprefixifpresent": 1, "ossinputstreamtest": 1, "understoremanagertest": 1, "createdirect": 2, "variants": 59, "identifying": 20, "openatposition": 6, "oss": 36, "localufs": 1, "cmd": 25, "ancestors": 10, "meant": 126, "leverage": 39, "ancestor": 29, "asyncpersist": 1, "enables": 208, "deprecation": 284, "remoteblockreader": 1, "document": 749, "known": 323, "communication": 59, "node": 3162, "uncleanliness": 2, "altogether": 24, "reverted": 42, "bundle": 355, "supports": 505, "seek/read": 1, "arbitrary": 131, "offsets": 196, "public": 952, "lossy": 3, "compared": 98, "cut": 42, "fixing": 299, "ufsconf": 1, "singleton": 109, "nullable": 158, "filesystemmaster": 14, "inodetree.java": 1, "filealreadyexistsexception": 8, "catches": 28, "pointers": 61, "destination": 155, "file.list": 1, "i/o": 73, "non-readable": 2, "potentials": 1, "npes": 33, "copyfromlocal": 12, "rare": 67, "./bin/alluxio": 2, "nonreadabledir": 1, "/destdir": 1, "understoreblockinstream": 2, "composition": 27, "protected": 77, "private": 418, "extended": 130, "slightly": 120, "expresses": 2, "difference": 144, "whitebox": 17, "snapshotted": 21, "thinks": 20, "/x": 2, "fileworkermastersyncexecutor": 1, "robust": 61, "'msessiontimeoutms": 1, "int-": 1, "int": 621, "alluxio/sessioninfo.java": 1, "msessiontimeoutms": 2, "boxing": 21, "alluxioblockstoretest": 1, "_alluxioblockstoretest_": 1, "generates": 205, "agents": 53, "agent": 197, "references": 350, "backward": 144, "currentpos": 1, "synchronized": 137, "filename": 78, "invalidates": 6, "positioned": 22, "beyond": 47, "equality": 134, "keeps": 137, "fairly": 88, "file-download": 1, "download": 124, "re-do": 1, "restutils": 2, "got": 199, "undone": 3, "ability": 312, "headers": 563, "consume": 201, "favor": 116, "tsx": 1, "package": 1138, "shrinkwrap": 1, "software": 20, "distributed": 132, "'as": 4, "basis": 71, "warranties": 1, "conditions": 277, "kind": 137, "url": 544, "calling": 463, "incurs": 3, "costs": 25, "querying": 88, "very": 500, "frequent": 21, "periodically": 100, "ownership": 91, "translation": 74, "alluxio-fuse": 9, "uid": 37, "gid": 17, "unix": 31, "uid/gid": 1, "uid==0": 1, "nobody": 15, "gid==0": 1, "nogroup": 1, "retrieves": 82, "think": 328, "asked": 39, "mailing": 10, "cherry": 477, "pick": 206, "webdoc": 1, "transport": 468, "framesize": 1, "frame": 387, "match": 984, "larger": 217, "pointing": 48, "page": 611, "filesystemmasterclient": 1, "filesystemworkerclient": 2, "interacting": 13, "moves": 312, "constructors": 129, "specifying": 153, "cherry-pick": 37, "allocateblockwithview": 1, "transferring": 6, "refused": 11, "connect": 422, "subject": 104, "masterinquireclient": 3, "external": 417, "either": 707, "along": 214, "package-private": 40, "nettydataserver": 1, "mock": 322, "blockreader": 1, "blockwriter": 1, "runner": 299, "blockworker": 3, "filesystemworker": 1, "throttle": 67, "high": 250, "cpu": 164, "determines": 74, "average": 126, "computable": 3, "jobworkerhealthreporter": 1, "throttled": 40, "taskexecutormanager": 3, "unthrottled": 3, "unthrottle": 1, "noitfy": 1, "components": 322, "considered": 341, "status.running": 2, "plan": 323, "inject": 105, "basefilesystem": 1, "basefilesystemtest": 3, "explicit": 309, "'permissionchecktest": 2, "verifyread": 2, "&": 1103, "verifygetfileid": 2, "permissionchecktest": 4, "recover": 80, "occurred": 110, "float": 286, "integers": 53, "percentage": 82, "persistence": 87, "displaying": 23, "aligned": 73, "typos": 85, "capital": 9, "letter": 39, "authoring": 3, "growing": 12, "embedded": 164, "in-process": 23, "showed": 24, "standby": 69, "masters": 38, "showing": 73, "likely": 233, "insufficient": 25, "journals": 17, "authority": 277, "authorities": 13, "delimited": 47, "'+": 8, "tried": 114, "hibench-spark": 1, "worked": 73, "phases": 88, "phase": 529, "comma": 102, "breaks": 95, "splits": 111, "happy": 52, "nice": 72, "board": 3, "supporting": 145, "'ll": 340, "followup": 84, "non": 212, "scripts": 138, "alluxio-perf": 1, "+x": 1, "autogenerated": 14, "compiler": 200, ".version": 13, "perf": 33, "conflict": 152, "several": 280, "cooperating": 1, "polling": 67, "polls": 12, "wakes": 3, "aggregated": 94, "launch": 43, "msyncpathstatus": 1, "stopsyncinternal": 1, "mfiltermap.get": 1, "mountid": 4, "concurrentmodificationexception": 22, "outstanding": 54, "four": 84, "syncfuture.cancel": 1, "recorded": 60, "past": 152, "notify": 134, "activesync": 2, "cherrypicked": 4, "umount": 12, "fs.mount": 2, "fs.umount": 3, "busy": 37, "jnr-fuse": 3, "executed": 489, "exiting": 24, "zk": 297, "serving": 32, "shut": 123, "quickly": 293, "reduces": 145, "~": 74, "curator": 62, "expose": 308, "wrap": 207, "eof": 19, "appropriately": 36, "detecting": 30, "cleaned": 132, "cosmetic": 12, "restriction": 61, "hostname": 254, "permit": 48, "underscore": 51, "character": 236, "gethost": 1, "combination": 80, "diamond": 8, "operator": 336, "guava": 163, "shorthand": 14, "progress": 276, "initfrombackup": 1, "scope": 238, "alluxio-underfs-web": 1, "hang": 57, "builds": 268, "seems": 277, "maven": 236, "backups": 54, "non-ideal": 1, "restore": 281, "inner": 211, "bottom": 30, "bump": 187, "hold": 287, "successfully": 274, "crashes": 27, "record": 1025, "infinity": 39, "broken": 254, "gene": 1, "rawtable": 1, "mfilesystem.createrawtable": 1, "test_table_dir": 1, "msuccessnum": 2, "break": 281, "success": 181, "crashed": 23, "jenkins": 411, "couple": 198, "lets": 96, "pread": 10, "fsdatainputstream": 5, "op": 67, "discard": 47, "hence": 385, "datanode": 9, "network": 275, "folds": 6, "workload": 17, "distribute": 26, "migratedefinition": 2, "migratecommands": 1, "jobs_per_worker": 1, "equally": 15, "sized": 24, "distributedcp": 8, "distributedmv": 5, "faster": 195, "applied": 351, "persistcommand": 1, "scenario": 245, "r4.xlarge": 3, "100kb": 4, "factor": 106, "signaled": 1, "schedule": 159, "itself": 525, "hide": 92, "hides": 18, "checkstyles": 7, "localfirstavoidevictionpolicy": 2, "locality": 69, "cleanups": 45, "code-side": 1, "localfirstpolicy": 4, "decisions": 23, "invokes": 63, "up-to-date": 36, "seeking": 13, "overrides": 151, "detailed": 121, "api-level": 1, "miredot": 1, "snapshotcommand": 2, "snapshot/checkpoint": 2, "recent": 179, "debugging": 219, "going": 260, "unbounded": 51, "disk": 305, "ignoring": 88, "tachyon": 1, "load/store": 9, "exposing": 65, "underlayer": 1, "diskstatus": 1, "rr": 10, "replication": 114, "eligible": 34, "robin": 10, "generate-tarball": 1, "supportspath": 1, "hdfsversion.java": 2, "eventloopgroup": 12, "held": 96, "us": 868, "minimal": 88, "defaultblockworkerclient": 3, "feng": 3, "customize": 136, "tier": 271, "aims": 46, "freely": 7, "simplifies": 97, "nap-ghj": 2, "core/common/src/main/java/alluxio/collections/concurrenthashset.java": 2, "mg1633024": 1, "concurrenthashset.java": 1, "inputs": 239, "batches": 117, "operated": 3, "successful": 255, "combined": 94, "execute": 505, "append": 164, "a.": 26, "b.": 23, "src": 38, "gcs": 139, "dst": 26, "refactored": 190, "deletebuffer": 1, "operationbuffer": 1, "counter": 214, "taken": 191, "/alluxio/core/common/src/test/java/alluxio/util/executor/controllableschedulertest.java": 2, "tracestack": 1, "mrg": 1, "shared": 347, "catch": 285, "dep": 23, "capacity": 276, "threadpool": 61, "cores": 24, "free/used": 1, "greater": 154, "cloud": 174, "ufses": 4, "reauthentication": 3, "health": 179, "rc1": 2, "employed": 3, "kicks": 18, "reconnects": 5, "especially": 191, "force": 286, "informing": 6, "disconnected": 37, "journaltooltest": 1, "journaltool": 4, "increases": 52, "saw": 34, "contributor": 29, "100mb": 9, "10mb": 13, "en": 6, "upstream": 97, "allowed": 612, "configure": 422, "expiration": 75, "alluxiofs": 3, "proposal": 22, "chose": 31, "pos/limit": 2, "evaluate": 127, "worthwhile": 9, "safety": 62, "mexternalfileinstream": 1, "fileinstream": 15, "hit": 224, "newer": 132, "inherit": 52, "s3a.inherit_acl=false": 1, "afs": 3, "usera": 6, "/usera": 3, "--": 788, "alluxio.underfs.s3a.inherit_acl=false": 1, "/usera/s3a": 2, "//adit-s3a-test/": 2, "drwxr-xr-x": 1, "0-0-0": 69, "0:0:0:0": 2, "pulling": 49, "deletes": 229, "underfilesystemfile": 1, "metadatasyncinterval": 1, "omission": 4, "assumed": 109, "implicitly": 100, "sending": 305, "intentionally": 81, "withinsetattributepoptions": 1, "inclusion": 27, "omitted": 43, "whatever": 88, "authenticate": 76, "intercept": 30, "bi-di": 2, "faulted": 2, "releasing": 69, "license": 529, "fault": 33, "tolerance": 12, "org.junit.assert.fail": 3, "heartbeatcontexttest": 1, "generalized": 10, "realistic": 13, "edges": 24, "locks": 182, "locking": 95, "zengjiemin": 1, "smallfix": 6, "alluxio.master.lineage.checkpoint.checkpointlatestplannertest": 2, "account": 359, "resides": 16, "min": 185, "skipping": 93, "fetch": 474, "starting": 449, "desired": 112, "multi": 145, "masterfaulttoleranceintegrationtest": 3, "killing": 25, "hundreds": 13, "destabilizes": 2, "fault-tolerance": 2, "tons": 11, "kill": 107, "took": 79, "went": 56, "0:0": 65, "outputs": 115, "prompt": 20, "console": 170, "say": 97, "follows": 263, "alluxio/core/common/src/main/java/alluxio/cli/abstractshell.java": 1, "general": 234, "solution": 175, "verified": 476, "i.e.": 381, "annotated": 295, "serializers": 225, "recovering": 29, "trouble": 19, "startup": 309, "stick": 14, "fsdataoutputstream.hflush": 1, "filesystem.getdefaultblocksize": 1, "/testfile-create": 2, "filesystem.gedefaultreplication": 1, "acceptable": 30, "invalidpathexception": 3, "_keyvaluesystemintegrationtest_": 1, "_filesystemrenameintegrationtest_": 1, "_filesystemstatisticstest_": 1, "_dfsiointegrationtest_": 1, "_filesystemmasterintegrationtest_": 1, "simplified": 112, "cpcommand": 1, "aboslutepath": 1, "tolocal": 1, "recognize": 41, "relative": 175, "removedkey": 1, "alluxio.user.block.avoid.eviction.policy.reserved.size.bytes": 1, "diff": 59, "getconf": 1, "version-rc4": 3, "life": 51, "alluxio.worker": 1, "extensible": 25, "backward-compatible": 5, "v1.0": 11, "unlock": 18, "metric.java": 1, "alluxio/core/common/src/main/java/alluxio/metrics/metric.java": 2, "helpful": 89, "compute": 228, "frameworks": 188, "greatly": 22, "protocols": 79, "tmp": 53, "mexpectedexception.expect": 1, "ioexception.class": 1, "mexpectedexception.expectmessage": 1, "exceptionmessage.different_master_address": 1, ".getmessage": 2, "newuri": 1, "originaluri": 1, "bring": 70, "assert.fail": 1, "hibench": 1, "java.io.ioexception": 2, "hibench-spark-rl-peis-:0": 1, "hibench-spark-rl-peis-/0.xx.xx.xx:0": 1, "0/0/0": 40, "0:0:0": 53, "mapreduce.job": 1, "counters": 95, "org.apache.hadoop.mapred.jobclient.runjob": 1, "jobclient.java:0": 1, "hibench.bayesdata.createbayesdata": 1, "bayesdata.java:0": 2, "hibench.bayesdata.generate": 1, "hibench.datagen.run": 1, "datagen.java:0": 2, "org.apache.hadoop.util.toolrunner.run": 1, "toolrunner.java:0": 1, "hibench.datagen.main": 1, "sun.reflect.nativemethodaccessorimpl.invoke0": 2, "native": 715, "sun.reflect.nativemethodaccessorimpl.invoke": 2, "localalluxioalluxiocluster": 1, "localfilesystemcluster": 1, "intends": 7, "underfs_address": 1, "glusterfs": 1, "coded": 19, "outbound": 61, "invoking": 57, "cancels": 23, "cancelling": 24, "impact": 730, "released": 181, "terminates": 27, "occupy": 6, "mean": 129, "pinning": 7, "2g": 7, "builder": 428, "determined": 103, "losing": 14, "readability": 54, "extending": 71, "ssh": 13, "getfilesystem": 2, "jobmaster/worker": 1, "contexts": 123, "filesystem/context": 2, "definitions": 167, "respective": 52, "master/worker": 4, "program": 152, "aim": 16, "threadpools": 5, "jobworkers": 2, "client+context": 2, "selecting": 32, "lots": 63, "executorservice": 31, "threadlocal": 26, "impersonation": 11, "passes": 136, "real": 290, "delegates": 63, "proxyuser": 3, "authenticatedclientuser": 1, "grpcexecutors": 1, "unsets": 1, "leader": 461, "mexecutorsforclient.shutdown": 1, "creator": 21, "metastore": 96, "catalogmasterclient": 1, "grpc/catalog_master.proto": 2, "assure": 2, "scheme": 131, 